app/Controllers/Admin.php

SELECT *
FROM `timeline`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows` FROM `posts`
SELECT COUNT(*) AS `numrows` FROM `categories`
SELECT COUNT(*) AS `numrows` FROM `comments`
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `post_status` = 'published'
SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `post_status` = 'draft'
SELECT COUNT(*) AS `numrows`
FROM `comments`
WHERE `comment_status` = 'approve'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `user_role` = 'subscriber'
---
    public function index()
    {
        $postModel = new PostsModel();
        $categoryModel = new CategoryModel();
        $commentModel = new CommentModel();
        $userModel = new UserModel();
        $timeline = new Timeline();
        $timelinedata = $timeline->orderBy('created_at', 'DESC')->limit(5)->get()->getResultArray();
        $postCount = $postModel->countAll();
        $categoryCount = $categoryModel->countAll();
        $commentCount = $commentModel->countAll();
        $userCount = $userModel->countAll();
        $publishPostCount = $postModel->where('post_status', 'published')->countAllResults();
        $draftPostCount = $postModel->where('post_status', 'draft')->countAllResults();
        $approveCommentCount = $commentModel->where('comment_status', 'approve')->countAllResults();
        $subscriberCount = $userModel->where('user_role', 'subscriber')->countAllResults();