app/Controllers/Categories.php

SELECT *
FROM `categories`
---
    public function index()
    {
        $categoryModel = new CategoryModel();
        $categories = $categoryModel->findAll();