app/Controllers/Comments.php

    public function index()
    {
        $pager = \Config\Services::pager();
        $perPage = 10;
        $commentModel = new CommentModel();
        $postModel = new PostsModel();
        $posts = $postModel->findAll();
        $comments = $commentModel->select('comments.*, posts.post_tittle')
            ->join('posts', 'posts.post_id = comments.comment_post_id')->paginate($perPage);
---
SELECT *
FROM `posts`
SELECT COUNT(*) AS `numrows`
FROM `comments`
JOIN `posts` ON `posts`.`post_id` = `comments`.`comment_post_id`
SELECT `comments`.*, `posts`.`post_tittle`
FROM `comments`
JOIN `posts` ON `posts`.`post_id` = `comments`.`comment_post_id`
 LIMIT 10