app/Controllers/Content.php

    public function index()
    {
        $courosel = new ContentModel();
        $content = $courosel->where('content_section', 'courosel')->findAll();
---
SELECT *
FROM `content`
WHERE `content_section` = 'courosel'