app/Controllers/ForgotPassword.php

SELECT *
FROM `categories`
---
    public function index()
    {

        $categoryModel = new CategoryModel();
        $categories = $categoryModel->findAll();

SELECT *
FROM `users`
WHERE `user_email` = 'sachin2@gmail.com'
 LIMIT 1
UPDATE `users` SET `reset_token` = '0b008fbbfaa436eca5d75817392fb1c8'
WHERE `user_id` = '29'
---
    public function sendResetLink()
    {
        $email = $this->request->getPost('email');
        $validationRules = [
            'email' => 'required|valid_email',
        ];

        if (!$this->validate($validationRules)) {
            return redirect()->to('forgot')->withInput()->with('fail', 'Invalid email address.');
        }
        $userModel = new UserModel();
        $user = $userModel->where('user_email', $email)->first();

        if (!$user) {
            return redirect()->to('forgot')->withInput()->with('fail', 'Email not found.');
        }

        $token = bin2hex(random_bytes(16)) ;
        $userModel->set('reset_token', $token)->where('user_id', $user['user_id'])->update();