app/Controllers/Home.php

    public function index()
    {
        $content =new ContentModel();
        $couroselContent = $content->getCouroselContent();
        $bootstrap = $content->getheroContent();
        $feature = $content->getFeatureContent();
        $featureHeading =$content->getFeatureHeading();
        $pager = \Config\Services::pager();
        $postModel = new PostsModel();
        $categories = new CategoryModel();
        $pagesModel = new PageModel();
        $pages =  $pagesModel->findAll();
        $perPage = 6;
        $posts = $postModel->where('post_status', 'published')->paginate($perPage);
        $categories = $categories->findAll();
---
SELECT *
FROM `pages`
SELECT *
FROM `posts`
WHERE `post_status` = 'published'
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `post_status` = 'published'
SELECT *
FROM `categories`

    public function individualPost($postId) {
        $postModel = new PostsModel();
        $categories = new CategoryModel();
        $categories = $categories->findAll();
        $commentModel = new CommentModel();
        $recentPost =$postModel->findAll();
        $pagesModel = new PageModel();
        $pages =  $pagesModel->findAll();
        $comments = $commentModel->where('comment_post_id', $postId)->findAll();
        $post = $postModel->select('posts.*, categories.cat_tittle')
            ->join('categories', 'categories.cat_id = posts.post_category_id')
            ->where('posts.post_status', 'published')
            ->find($postId);
---
SELECT *
FROM `categories`
SELECT *
FROM `posts`
SELECT *
FROM `pages`
SELECT *
FROM `comments`
WHERE `comment_post_id` = '33'
SELECT `posts`.*, `categories`.`cat_tittle`
FROM `posts`
JOIN `categories` ON `categories`.`cat_id` = `posts`.`post_category_id`
WHERE `posts`.`post_status` = 'published'
AND `posts`.`post_id` = '33'

    public function postsByCategory($categoryId)
    {
        $pager = \Config\Services::pager();
        $postModel = new PostsModel();
        $categories = new CategoryModel();
        $categories = $categories->findAll();
        $pagesModel = new PageModel();
        $pages =  $pagesModel->findAll();
        $data['categoryPosts'] =  $postModel->select('posts.*, categories.cat_tittle')
        ->join('categories', 'categories.cat_id = posts.post_category_id')->where('post_category_id', $categoryId)->where('posts.post_status', 'published')->paginate(3);
---
SELECT *
FROM `categories`
SELECT *
FROM `pages`
SELECT COUNT(*) AS `numrows`
FROM `posts`
JOIN `categories` ON `categories`.`cat_id` = `posts`.`post_category_id`
WHERE `post_category_id` = '9'
AND `posts`.`post_status` = 'published'
SELECT `posts`.*, `categories`.`cat_tittle`
FROM `posts`
JOIN `categories` ON `categories`.`cat_id` = `posts`.`post_category_id`
WHERE `post_category_id` = '9'
AND `posts`.`post_status` = 'published'
 LIMIT 3