app/Controllers/Login.php

SELECT *
FROM `categories`
---
    public function index()
    {
        $categoryModel = new CategoryModel();
        $categories = $categoryModel->findAll();

SELECT *
FROM `users`
WHERE `username` = 'sadiya@gmail.com'
 LIMIT 1
---
    public function log()
    {
        $userModel = new UserModel();

        $email = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $user = $userModel->where('username', $email)->first();