app/Controllers/Pages.php

    public function showSlug($slug){
      $categories = new CategoryModel;
      $categories  =$categories->findAll();
        $contentModel = new ContentModel();
        $pageModel = new PageModel();
        $pages = $pageModel->findAll();
---
SELECT *
FROM `pages`