app/Controllers/Posts.php

SELECT *
FROM `categories`
---
    public function addPost()
    {
        $postModel = new PostsModel();
        $categoryModel = new CategoryModel();
        $categories = $categoryModel->findAll();