app/Controllers/Users.php

    public function index()
    {
        $userRole = session()->get('userData')['user_role'];

        // Check if the user has the required role to access the page
        if ($userRole !== 'admin') {
            return redirect()->to('admin')->with('fail', 'You do not have permission to view all users.');
        }
        $userModel = new UserModel();
        $pager = \Config\Services::pager();
        $perPage = 10;
        $users = $userModel->paginate($perPage);
---
SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`