app/Models/ContentModel.php

SELECT *
FROM `content`
WHERE `content_section` = 'courosel'
 LIMIT 3
---
public function getCouroselContent() {
    return $this->where('content_section','courosel')
    ->limit(3)->get()->getResultArray();

SELECT *
FROM `content`
WHERE `content_section` = 'bootstrap'
 LIMIT 1
---
public function getheroContent() {
    return $this->where('content_section','bootstrap')
    ->limit(1)->get()->getResultArray();

SELECT *
FROM `content`
WHERE `content_section` = 'feature'
 LIMIT 6
---
public function getFeatureContent() {
    return $this->where('content_section','feature')->limit(6)->get()->getResultArray();;

SELECT *
FROM `content`
WHERE `content_section` = 'feature_heading'
 LIMIT 1
---
public function getFeatureHeading() {
    return $this->where('content_section','feature_heading')
    ->limit(1)->get()->getResultArray();;

SELECT *
FROM `content`
WHERE `content_page_id` = '7'
AND `content_section` = 'bootstrap'
---
public function getheroContentByPage($pageId) {
    return $this ->where('content_page_id',$pageId)
    ->where('content_section','bootstrap')
    ->findAll();

SELECT *
FROM `content`
WHERE `content_page_id` = '7'
AND `content_section` = 'feature'
---
public function getFeatureContentByPage($pageId) {
    return $this->where('content_page_id' , $pageId)
    ->where('content_section','feature')
    ->findAll();

SELECT *
FROM `content`
WHERE `content_page_id` = '7'
AND `content_section` = 'feature_heading'
---
public function getFeatureHeadingByPage($pageId) {
    return $this->where('content_page_id', $pageId)
    ->where('content_section','feature_heading')
    ->findAll();

SELECT *
FROM `content`
WHERE `content_page_id` = '7'
AND `content_section` = 'courosel'
---
public function getCouroselContentByPage($pageId) {

  return $this->where('content_page_id',$pageId)
    ->where('content_section','courosel')
    ->findAll();