app/Models/PageModel.php

SELECT *
FROM `pages`
WHERE `slug` = 'about-us'
 LIMIT 1
---
    public function findBySlug($slug)
    {
       $query =$this->where('slug', $slug)->first();